#pragma once

// "I can eat glass" text from http://kermitproject.org/utf8.html

const char EAT_GLASS_TEXT[] =
    "I can eat glass and it doesn't hurt me. "
    "Je peux manger du verre, ça ne me fait pas mal. "
    "Puedo comer vidrio, no me hace daño. "
    "Я могу есть стекло, оно мне не вредит. "
    "मैं काँच खा सकता हूँ और मुझे उससे कोई चोट नहीं पहुंचती. "
    "أنا قادر على أكل الزجاج و هذا لا يؤلمني. "
    "אני יכול לאכול זכוכית וזה לא מזיק לי. "
    "Tôi có thể ăn thủy tinh mà không hại gì. "
    "ฉันกินกระจกได้ แต่มันไม่ทำให้ฉันเจ็บ "
    "我能吞下玻璃而不伤身体。"
    "我能吞下玻璃而不傷身體。"
    "私はガラスを食べられます。それは私を傷つけません。"
    "나는 유리를 먹을 수 있어요. 그래도 아프지 않아요 ";

const char EMOJI_TEXT[] =
    "I🙂can😋eat🍽️glass👓🔍🪞🥂🪟and☝️it🙅doesn’t🤕hurt👍me."
    // Invisible code points warning!
    "🐕" // dog
    "🦮" // service dog
    "🐕‍🦺" // guide dog (3 code points)
    "🇦🇶" // Antarctica (2 code points)
    "🏴‍☠️" // pirate flag (4 code points)
    "";
